<template>
  <v-app>
    <div class="air-conditioner-faq">
      <div class="main-contents-wrap">
        <!-- ↓ パンくず -->
        <breadcrumbs :breadcrumbs="breadcrumbs" />
        <!-- ↑ パンくず -->

        <guideTitle :txt="'設置サービス（エアコン）設置工事 よくあるお問い合わせ'" />

        <div class="w760 mb-sm-10">
          <v-container>
            <div v-for="(inquiry, index) in inquiryList" :key="index">
              <v-sheet class="pa-2 caption text-sm-subtitle-1" color="#eee"
                ><span class="text-h6 font-weight-bold blue-text mr-2">Q</span>{{ inquiry.q }}</v-sheet
              >
              <p class="caption text-sm-subtitle-1 pt--2 px-2 px-sm-7 mb-7"><span class="text-h6 font-weight-bold red--text mr-2">A</span>{{ inquiry.a }}</p>
            </div>
          </v-container>
        </div>
      </div>
    </div>
  </v-app>
</template>

<script lang="ts">
import Vue from 'vue';
import Breadcrumbs from '@/components/common/breadcrumbs.vue';
import { reactive, toRefs } from '@vue/composition-api';
import GuideTitle from '@/components/common/guide/title.vue';
export default Vue.extend({
  name: 'air-conditioner-faq',
  components: {
    breadcrumbs: Breadcrumbs,
    guideTitle: GuideTitle,
  },
  setup: (props, context) => {
    document.title = '設置サービス（エアコン）設置工事 よくあるお問い合わせ｜カメラのキタムラネットショップ'
    const state = reactive({
      breadcrumbs: [
        {
          path: 'ネットショップ',
          linkUrl: '/',
          disabled: false
        },
        {
          path: '設置サービス（エアコン）',
          linkUrl: 'air-conditioner',
          disabled: false
        },
        {
          path: '設置サービス（エアコン）設置工事 よくあるお問い合わせ',
          disabled: true
        }
      ],
      //お問い合わせリスト
      inquiryList: [
        { q: '設置工事はどんな人がやるのでしょうか？', a: '1,000万件以上の工事実績を持つ「株式会社工事センター」の研修を受けたプロのサービススタッフが伺います。作業後も1年間の保証がついているので、安心です。' },
        { q: '追加料金はどのような場合に必要になりますか？', a: 'お客様宅の設置環境により異なります。室外機の設置方法や取付先の設置環境によりますが、工事お打合せの際にお客様宅の設置環境の聞き取りをさせて頂きます。' },
        { q: 'エアコンの工事はどれくらいの作業時間がかかりますか？', a: '標準的なもので、エアコン取外しが３０～６０分程度、エアコン取付が６０～１２０分程度です。' },
        { q: 'エアコン用の配管穴が無いのですが、取付できますか？', a: 'はい、可能でございます。木造、ＡＬＣであれば無料で穴あけを行います。壁がコンクリートの場合も、別途費用にて穴あけを承ります。また壁に穴を開けない方法（窓パネル使用）でのエアコン取付もご提案させて頂きます。' },
        { q: ' エアコンの配管が壁の中にあります。工事料金はどのくらいかかりますか？', a: '隠蔽配管の場合、料金につきましては一概にはご案内致し兼ねます。場合によっては配管の洗浄が必要であったり、埋設の具合にもよりますので、まずはお気軽にお問合せ下さい。' },
        { q: '悪天候で雨や風が強い場合は、工事できますか？', a: 'マンションのベランダなどでの作業であれば可能な場合もございますが、屋根の上での作業や梯子を使用しての作業がある場合などはご遠慮させて頂く事もございます。' },
        { q: 'エアコン取付工事後、室外機の位置を変更してもらうようお願いした場合無料でしてもらえますか？', a: '申し訳ございません。取付工事の室外機移動にはエアコンの取外・取付作業が必要となりますので、有償での対応となります。' },
        { q: '取付先に電気が通っていませんが、取付はできますか？', a: '申し訳ございません。取付作業後試運転までが工事作業となり取付先に電気が通っていない場合、動作確認が出来ませんので、工事保証が出来なくなります。' },
        { q: 'エアコンの工事は何名で来られるのでしょうか？', a: '基本的には１名で訪問致しますが、場合によっては複数名での訪問をおこなっております。 ' },
        { q: '工事の保証はありますか？', a: '１年間の工事保証があります。' },
        { q: '工事申込み後、都合が悪くなったので日程変更したいのですが？', a: 'はい、可能でございます。お早めにご相談ください。' },
        { q: '申込み後、キャンセルはできますか？', a: 'はい、可能でございます。但し、訪問後のキャンセルになりますとキャンセル料がかかる場合がございますので、お早めにご連絡頂く様お願い致します。' },
        { q: '訪問時間の指定はできますか？', a: '申し訳ございません。訪問時間の指定はお受けしておりません。お約束の日にちの朝９時前後に担当の作業員より訪問時間のご連絡を差し上げております。' },
        { q: '本日申し込みをした場合で、最短でいつ工事ができますか？', a: '工事の予約状況により変動致しますので、当店までお気軽にご相談下さい。' },
        { q: 'オプションの工事代金は、いつどのように支払うのでしょうか？', a: 'オプションの工事代金は、工事完了後、直接訪問した作業員へ現金でお支払いください。' },
        { q: 'オプション工事の領収証は発行してもらえますか？', a: 'はい、オプション工事の領収証も発行致します。お支払いの際に現地にてお渡ししております。' },
        { q: '振込みやクレジットカードでの支払いはできますか？', a: '申し訳ございません。振込みやクレジットカードでのでのお支払いはお受けしておりません。' },
        { q: 'エアコン工事の際に、なにか準備しておくことはありますか？', a: 'エアコン取外し工事の場合、ガス回収時にリモコンを使用させて頂きますので、リモコンのご準備をお願いします。 エアコン取付の際は、特にお客様にてご準備頂くものはございませんが、室内機の真下に脚立を立てられる作業スペースを空けておいて頂けると助かります。' },
        { q: 'エアコン用のコンセントがありませんが、コンセントは設置してもらえますか？', a: 'はい、エアコン専用電気配線も承っております。' },
        { q: '土日での工事をお願いしたいのですが、割増料金など発生しますか？', a: '割増料金は発生致しませんが、土日は工事のスケジュールが混み合う場合がございますので、平日の工事をお勧めいたします。' },
        { q: 'エアコンの化粧カバー（屋外）は何色があるのですか？', a: 'オプションでアイボリー、ブラウン、グレー、ブラックをご準備しております。化粧カバーをご要望の場合は、予めご希望の色をお伝えください。' },
        { q: 'エアコンのリサイクルをお願いする場合、リサイクル券は購入しておく必要がありますか？', a: ' リサイクル券は株式会社工事センターで発行いたしますので、お客様でご準備頂く必要はありません。' },
      ]
    });
    return {
      ...toRefs(state),
    };
  }
});
</script>

<style scoped>
.blue-text {
  color: #00F;
}
</style>